---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
source: html/493964bd-29ba-1752-02ee-d129d8aa44f4.htm
---
# FabricationPartRouteEnd Members

Create fabrication routing end from centerline point on straight element.